Revit 2027 API
ComboBoxData Properties
The ComboBoxData type exposes the following members.
Properties
Name | Description
Image | The image shown on the ComboBox.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ItemData)
LongDescription |  Long description of the command tooltip
(Inherited from RibbonItemData)
Name |  The internal name of the item.
(Inherited from ItemData)
ToolTip |  The tooltip of item.
(Inherited from ItemData)
ToolTipImage | The image to show as a part of the button extended tooltip
(Inherited from RibbonItemData)
Top
See Also
Reference
ComboBoxData Class
Autodesk.Revit.UI Namespace